import { useState } from 'react';
import { NextPage } from 'next';
import { useRouter } from 'next/router'
import Link from 'next/link';
import * as S from '../../styled/Search'
/*
type tagType = {
    title: string,
    list: string[];
}*/S

const Search/*: NextPage<{}>*/ = () => {

    const router = useRouter();

    const [word, setWord] = useState("");

    const tag/* : tagType[]*/ = [
                {title: "인기", list:["드라마", "라이트노벨", "로맨스", "무협", "스포츠", "일상", "전생", "중세", "판타지", "하렘", "현대", "SF", "게임", "남성향", "먼치킨", "빙의", "성장", "순애", "아카데미", "얀데레", "이세계", "집착", "착각", "패러디", "헌터", "회귀", "TS"]},
                {title: "장르", list:["가상현실", "게임", "게임시스템", "게임판타지", "공포", "기갑", "님성향", "노맨스", "느와르", "다크판타지", "단편", "디스토피아", " 러브코미디", "메카", "메카닉", "미스터리", "밀리터리", "백합", "복수", "복수물", "사이버펑크", "성장", "수필", "순애", "순한맛", "스릴러", "시리어스", "아카데미", "아포칼립스", "액션", "어반", "연애", "오컬트", "옴니버스", "육성", "이세계", "정통판타지", "좀비", "주술회전", "청춘", "추리", "패러디", "포스트아포칼립스", "퓨전", "퓨전판타지", "하드", "현대물", "현대판타지", "호러", "환생", "힐링", "RPG", "TS"]},
                {title: "인물", list:["고인물", "기사", "남매", "네크로맨서", "누나", "능력", "능력자", "능력자배틀", "드래곤", "마녀", "마법", "미법사", "마법소녀", "마왕", "마피아", "매니저", "먼치킨", "메이드", "몬무스", "문제아", "미소녀", "배우", "병약", "빌런", "상태창", "서큐버스", "성장형", "성죄", "소꿉친구", "소환", "수인", "스트리머", "시한부", "아이돌", "악당", "악마", "악역", "악역영애", "얀데레", "엘프", "여동생", "여주", "용병", "용사", "이능", "이능력", "이종족", "정령", "치원이동", "천재", "초능력", "헌터", "흡혈귀", "히어로"]},
                {title: "소재", list:["걸그룹", "게이트", "게임빙의", "겜판", "격투", "경영", "경헙담", "고양이", "군대", "귀환", "꽁냥", "남녀역전", "납치", "눈물", "대체역사", "던전", "레이드", "루프", "모헙", "방송", "배틀", "범죄", "병맛", "부활", "비트고인", "빙의", "사랑", "사망회귀", "생존", "서바이벌", "성장형먼치킨","소설빙의", "스팀펑크", "시간정지", "실화", "야구", "엔터테인먼트", "여주인공", "역사", "연예계", "요리", "우주", "육아", "일기", "전이", "전쟁", "전투", "정치", "주식", "집착", "착각계", "코인", "크툴루", "탑", "투자", "프로게이머", "하이스쿨", "학교", "회귀", "후회"]}, 
                {title: "패러디", list:["가면라이더" ,"갓오하", "건담", "귀멸", "귀멸의칼날", "나노하", "니루토", "나이트런", "내청춘", "다크소울", "단간론파", "던만추", "던파", "데어라", "데이트어라이브", "동방", "동방프로젝트", "라오루", "롤", "리제로", "마블", "메이플", "메이플스트리", "명일방주", "몬스터헌터", "뱅드림", "벽람항로", "보컬로이드", "블리치", "삼국지", "소녀전선", "스카이림", "스타크래프트", "신의탑", "아이돌마스터", "오버로드", "오버워치.우마무스메", "원신", "원펀맨", "원피스", "유희왕", "죠죠", "진격의거인", "코노스바", "클로저스", "타입문", "팬픽", "페그오", "페이트", "포켓몬", "포켓몬스터", "히로아카", "2차창작", "FATE", "FGO", "LOL", "SAO", "SCP"]},
                {title: "기타", list:["공모전", "괴물", "근대", "근미래", "기억상실", "다중", "동양", "동양판타지", "동화", "마족", "몬스터", "미궁", "미래", "뱀파이어", "사이다", "슬라임", "시스템", "신", "여행", "연예인", "원작파괴", "이야기", "인외", "천사", "캣파이트", "퇴마"]}
            ]

    const Tag = ({tag}/*: tagType*/) => {
        return(
            <S.TagList>
                <b># {tag.title} 해시태그</b>
                <ul>
                {tag.list ?
                <>
                {tag.list.map((i/*: string*/, index/*: number*/) => {
                    return(
                        <Link href={`/search/tag/date/1/${i}`} key={index}>
                            <S.Tag>#{i}</S.Tag>
                        </Link>
                    )
                })}
                </>
                :
                <></>
                }
                </ul>
            </S.TagList>
        )
    }

    return(
        <S.Body>
            <S.Search placeholder="소설제목, 태그, 검색어, 작가를 입력해주세요." onChange={(e)=>setWord(e.target.value)} value={word} onKeyPress={(e)=>{
                if(e.key === "Enter" && word){
                    router.push(`/search/keword/date/1/${word}`)
                }
            }}/>
            <S.TagListDiv>
                <Tag tag={tag[0]}/>
                <Tag tag={tag[1]}/>
                <Tag tag={tag[2]}/>
                <Tag tag={tag[3]}/>
                <Tag tag={tag[4]}/>
                <Tag tag={tag[5]}/>
            </S.TagListDiv>
        </S.Body>
    )
}

export default Search